// Задача 42: Напишите программу, которая будет преобразовывать десятичное число в двоичное.
// 45 -> 101101
// 3  -> 11
// 2  -> 10



int x = 5;
Console.WriteLine(Convert.ToString(x, 2));
